---
kind: method
id: M:Autodesk.Revit.DB.FamilyInstance.GetCopingIds
zh: 族实例
source: html/6886b519-4a44-373f-59ab-4ceee51dd096.htm
---
# Autodesk.Revit.DB.FamilyInstance.GetCopingIds Method

**中文**: 族实例

Lists the elements currently used as coping cutters for this element.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetCopingIds()
```

## Returns
The coping ElementIds